MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
static void poll_uart_frames(void) {
  while (Serial.available() > 0) {
    const char c = static_cast<char>(Serial.read());

    if (c == '\r') {
      continue;
    }

    if (c == '\n') {
      if (uart_line_len > 0) {
        uart_line[uart_line_len] = '\0';
        handle_uart_line(uart_line);
        uart_line_len = 0;
      }
      continue;
    }

    if (uart_line_len + 1 >= sizeof(uart_line)) {
      Serial.println("[WARN] UART line overflow, drop current line");
      uart_line_len = 0;
      continue;
    }

    uart_line[uart_line_len++] = c;
  }
}

static void publish_sample_status(void) {
  publish_status_json(sample_status_seq++, 25.6F, 61.0F, 120, 1, 0, 0U, 15U);
}

static bool topic_to_relay_id(const char *topic, uint8_t *relay_id) {
  if (topic == nullptr || relay_id == nullptr) {
    return false;
  }

  for (uint8_t relay = 1; relay <= 4; relay++) {
    if (strcmp(topic, mqtt_topic_relay_set[relay - 1U]) == 0) {
      *relay_id = relay;
      return true;
    }
  }

  return false;
}

static int command_type_to_code(const char *command_type) {
  if (strcmp(command_type, "TRIGGER_SCENARIO") == 0) {
    return 1;
  }
  if (strcmp(command_type, "USER_ACK") == 0) {
    return 2;
  }
  if (strcmp(command_type, "CLEAR_ALARM") == 0) {
    return 3;
  }
  if (strcmp(command_type, "SIMULATE_NETWORK") == 0) {
    return 4;
  }
  if (strcmp(command_type, "SET_RELAY") == 0) {
    return 5;
  }
  return -1;
}

static int scenario_to_code(const char *scenario) {
  if (strcmp(scenario, "NONE") == 0) {
    return 0;
  }
  if (strcmp(scenario, "SOS_OR_FALL_SIM") == 0) {
    return 1;
  }
  if (strcmp(scenario, "LONG_STILL_NO_RESPONSE") == 0) {
    return 2;
  }
  if (strcmp(scenario, "OFFLINE_AUTONOMY") == 0) {
    return 3;
  }
  return -1;
}

static bool extract_json_string_value(const char *payload,
                                      const char *key,
                                      char *out,
                                      size_t out_size) {
  if (payload == nullptr || key == nullptr || out == nullptr || out_size == 0U) {
    return false;
  }

  char pattern[32];
  snprintf(pattern, sizeof(pattern), "\"%s\"", key);
  const char *key_pos = strstr(payload, pattern);
  if (key_pos == nullptr) {
    return false;
  }

  const char *colon = strchr(key_pos + strlen(pattern), ':');
  if (colon == nullptr) {
    return false;
  }

  const char *value = colon + 1;
  while (*value == ' ' || *value == '\t') {
    value++;
  }

  if (*value == '"') {
    value++;
    const char *end = strchr(value, '"');
    if (end == nullptr) {
      return false;
    }
    const size_t len = static_cast<size_t>(end - value);
    if (len == 0U || len >= out_size) {
      return false;
    }
    memcpy(out, value, len);
    out[len] = '\0';
    return true;
  }

  size_t len = 0;
  while (value[len] != '\0' && value[len] != ',' && value[len] != '}' &&
         value[len] != ' ' && value[len] != '\t') {
    len++;
  }
  if (len == 0U || len >= out_size) {
    return false;
  }
  memcpy(out, value, len);
  out[len] = '\0';
  return true;
}

static bool parse_relay_set_payload(const char *payload,
                                    char *request_id,
                                    size_t request_id_size,
                                    char *action,
                                    size_t action_size) {
  if (payload == nullptr || request_id == nullptr || action == nullptr ||
      request_id_size == 0U || action_size == 0U) {
    return false;
  }

  request_id[0] = '\0';
  action[0] = '\0';

  if (strcmp(payload, "ON") == 0 || strcmp(payload, "OFF") == 0) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
    strncpy(action, payload, action_size - 1U);
    action[action_size - 1U] = '\0';
    return true;
  }

  if (!extract_json_string_value(payload, "action", action, action_size)) {
    return false;
  }

  if (strcmp(action, "ON") != 0 && strcmp(action, "OFF") != 0) {
    return false;
  }

  if (!extract_json_string_value(payload, "request_id", request_id, request_id_size)) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
  }

  for (size_t i = 0; request_id[i] != '\0'; i++) {
    if (request_id[i] < '0' || request_id[i] > '9') {
      snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
      break;
    }
  }

  return true;
}

static bool parse_demo_command_payload(const char *payload,
                                       char *request_id,
                                       size_t request_id_size,
                                       int *command_type,
                                       int *scenario,
                                       int *value) {
  if (payload == nullptr || request_id == nullptr || command_type == nullptr ||
      scenario == nullptr || value == nullptr || request_id_size == 0U) {
    return false;
  }

  char command_type_text[24];
  char scenario_text[32];
  char value_text[12];

  if (!extract_json_string_value(payload, "command_type", command_type_text, sizeof(command_type_text))) {
    return false;
  }
  if (!extract_json_string_value(payload, "scenario", scenario_text, sizeof(scenario_text))) {
    strncpy(scenario_text, "NONE", sizeof(scenario_text) - 1U);
    scenario_text[sizeof(scenario_text) - 1U] = '\0';
  }
  if (!extract_json_string_value(payload, "value", value_text, sizeof(value_text))) {
    strncpy(value_text, "1", sizeof(value_text) - 1U);
    value_text[sizeof(value_text) - 1U] = '\0';
  }

  *command_type = command_type_to_code(command_type_text);
  *scenario = scenario_to_code(scenario_text);
  *value = atoi(value_text);
  if (*command_type < 0 || *scenario < 0) {
    return false;
  }

  if (!extract_json_string_value(payload, "request_id", request_id, request_id_size)) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
  }

  for (size_t i = 0; request_id[i] != '\0'; i++) {
    if (request_id[i] < '0' || request_id[i] > '9') {
      snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
      break;
    }
  }

