MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
  return true;
}

static void forward_relay_command_to_stm32(const uint8_t relay_id,
                                           const char *request_id,
                                           const char *action) {
  char frame[48];
  const int written = snprintf(frame, sizeof(frame), "C,%s,%u,%s\r\n", request_id, relay_id, action);
  if (written <= 0 || written >= static_cast<int>(sizeof(frame))) {
    Serial.println("[FAIL] relay command frame overflow");
    return;
  }

  Serial.print(frame);
}

static void forward_demo_command_to_stm32(const char *request_id,
                                          const int command_type,
                                          const int scenario,
                                          const int value) {
  char frame[48];
  const int written = snprintf(frame,
                               sizeof(frame),
                               "D,%s,%d,%d,%d\r\n",
                               request_id,
                               command_type,
                               scenario,
                               value);
  if (written <= 0 || written >= static_cast<int>(sizeof(frame))) {
    Serial.println("[FAIL] demo command frame overflow");
    return;
  }

  Serial.print(frame);
}

static void publish_demo_state(const char *request_id,
                               const int command_type,
                               const int scenario,
                               const int value,
                               const char *result) {
  char payload[160];
  const int written = snprintf(payload,
                               sizeof(payload),
                               "{\"node_id\":\"%s\",\"request_id\":%s,"
                               "\"command_type\":%d,\"scenario\":%d,"
                               "\"value\":%d,\"result\":\"%s\"}",
                               NODE_ID,
                               request_id,
                               command_type,
                               scenario,
                               value,
                               result);
  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] demo state payload overflow");
    return;
  }

  mqtt_client.publish(mqtt_topic_demo_state, payload, false);
}

static void on_mqtt_message(char *topic, byte *payload, unsigned int length) {
  uint8_t relay_id = 0;
  if (length + 1U > MQTT_PAYLOAD_MAX_LEN) {
    Serial.println("[WARN] MQTT payload too long");
    return;
  }

  char text[MQTT_PAYLOAD_MAX_LEN];
  memcpy(text, payload, length);
  text[length] = '\0';

  if (strcmp(topic, mqtt_topic_demo_command) == 0) {
    char request_id[16];
    int command_type = 0;
    int scenario = 0;
    int value = 0;

    if (!parse_demo_command_payload(text,
                                    request_id,
                                    sizeof(request_id),
                                    &command_type,
                                    &scenario,
                                    &value)) {
      Serial.print("[WARN] Invalid demo command payload: ");
      Serial.println(text);
      return;
    }

    forward_demo_command_to_stm32(request_id, command_type, scenario, value);
    publish_demo_state(request_id, command_type, scenario, value, "FORWARDED");
    return;
  }

  if (!topic_to_relay_id(topic, &relay_id)) {
    return;
  }

  char request_id[16];
  char action[8];
  if (!parse_relay_set_payload(text, request_id, sizeof(request_id), action, sizeof(action))) {
    Serial.print("[WARN] Invalid relay set payload: ");
    Serial.println(text);
    return;
  }

  forward_relay_command_to_stm32(relay_id, request_id, action);
}

static void subscribe_relay_topics(void) {
  for (uint8_t relay = 1; relay <= 4; relay++) {
    const bool ok = mqtt_client.subscribe(mqtt_topic_relay_set[relay - 1U]);
    Serial.print(ok ? "[INFO] Subscribed: " : "[WARN] Subscribe failed: ");
    Serial.println(mqtt_topic_relay_set[relay - 1U]);
  }
}

static void subscribe_gateway_topics(void) {
  subscribe_relay_topics();

  const bool ok = mqtt_client.subscribe(mqtt_topic_demo_command);
  Serial.print(ok ? "[INFO] Subscribed: " : "[WARN] Subscribe failed: ");
  Serial.println(mqtt_topic_demo_command);
}

static void connect_wifi(void) {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  const unsigned long now = millis();
  if ((last_wifi_attempt_ms != 0UL) && (now - last_wifi_attempt_ms < WIFI_RETRY_INTERVAL_MS)) {
    return;
  }
  last_wifi_attempt_ms = now;

  if (mqtt_client.connected()) {
    mqtt_client.disconnect();
  }

  Serial.print("[INFO] Connecting WiFi: ");
  Serial.println(WIFI_SSID);

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
}

static void connect_mqtt(void) {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  static bool logged_wifi_ip = false;
  if (!logged_wifi_ip) {
    logged_wifi_ip = true;
    Serial.print("[INFO] WiFi connected, IP: ");
    Serial.println(WiFi.localIP());
  }

  if (mqtt_client.connected()) {
    return;
  }

  const unsigned long now = millis();
  if ((last_mqtt_attempt_ms != 0UL) && (now - last_mqtt_attempt_ms < MQTT_RETRY_INTERVAL_MS)) {
    return;
  }
  last_mqtt_attempt_ms = now;

  Serial.print("[INFO] Connecting MQTT: ");
  Serial.print(MQTT_HOST);
  Serial.print(":");
  Serial.println(MQTT_PORT);

  if (mqtt_client.connect(mqtt_client_id)) {
    Serial.println("[INFO] MQTT connected");
    subscribe_gateway_topics();
    return;
  }

  Serial.print("[WARN] MQTT connect failed, state=");
  Serial.println(mqtt_client.state());
}

static void flush_pending_event(void) {
  if (!has_pending_event_payload || !mqtt_client.connected()) {
    return;
  }

  const bool ok = mqtt_client.publish(mqtt_topic_event, pending_event_payload);
  Serial.print(ok ? "[INFO] Publish cached event OK: " : "[WARN] Publish cached event failed: ");
  Serial.println(pending_event_payload);
  if (ok) {
    has_pending_event_payload = false;
    pending_event_payload[0] = '\0';
  }
}

static void send_network_heartbeat(bool force) {
  const unsigned long now = millis();
  const bool wifi_ok = (WiFi.status() == WL_CONNECTED);
  const bool mqtt_ok = mqtt_client.connected();
  const bool online = wifi_ok && mqtt_ok;

  if (!force &&
      has_last_network_online &&
      online == last_network_online &&
      (now - last_network_heartbeat_ms < NETWORK_HEARTBEAT_INTERVAL_MS)) {
    return;
  }

  has_last_network_online = true;
  last_network_online = online;
  last_network_heartbeat_ms = now;

  Serial.printf("H,%lu,%u,%u,%u\r\n",
                static_cast<unsigned long>(network_heartbeat_seq++),
                online ? 1U : 0U,
                wifi_ok ? 1U : 0U,
                mqtt_ok ? 1U : 0U);
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  build_mqtt_names();

  Serial.println();
  Serial.println("[INFO] ESP8266 MQTT UART gateway boot");
  Serial.println("[INFO] UART CSV formats: S,status E,event R,relay-result");
  Serial.println("[INFO] MQTT relay set and demo commands are forwarded as C/D frames");

  mqtt_client.setServer(MQTT_HOST, MQTT_PORT);
  mqtt_client.setCallback(on_mqtt_message);

  connect_wifi();
  connect_mqtt();
  send_network_heartbeat(true);
}

void loop() {
  connect_wifi();
  connect_mqtt();

  if (mqtt_client.connected()) {
    mqtt_client.loop();
    flush_pending_event();
  }

  poll_uart_frames();
  send_network_heartbeat(false);

  const unsigned long now = millis();
  if (ENABLE_SAMPLE_STATUS && now - last_publish_ms >= SAMPLE_STATUS_INTERVAL_MS) {
    last_publish_ms = now;
    publish_sample_status();
  }
}
